      
<?php get_header(); ?>

<main class="main">
  <div class="bread">
    <div class="container">
      <div class="bread__wrapper">
        <h1 class="bread__title">
          Блог
        </h1>
        <ul class="list-reset bread__list">
          <li class="bread__list-item">
            <a href="/" class="bread__list-link">Главная</a>
          </li>
          <li class="bread__list-item">
            <a class="bread__list-link">Блог</a>
          </li>
        </ul>
      </div>
      
    </div>
  </div>
  <section class="blog">
    <div class="container">
      <div class="blog__wrapper">
        <div class="blog__filter">
        <p class="blog__name">
          Поиск
        </p>
        <div class="blog__serch">
          <?php echo do_shortcode('[searchwp_form id=1]'); ?>
        </div>
        <p class="blog__name">
          Категории
        </p>
        <div class="blog__cats">
          <?php 
            // Получаем все категории, включая пустые, кроме "Без рубрики"
            $categories = get_categories(array(
                'hide_empty' => false, // Получаем все категории, включая пустые
                'exclude' => array(get_option('default_category')) // Исключаем категорию "Без рубрики"
            )); 

            // Проходим по каждой категории
            foreach ($categories as $category) {
                // Получаем ссылку на категорию
                $category_link = get_category_link($category->term_id);
                // Получаем количество постов в категории
                $post_count = $category->count;
            ?>
                <a href="<?php echo esc_url($category_link); ?>" class="blog__cat">
                  <?php echo esc_html($category->name); ?>(<?php echo esc_html($post_count); ?>)
                </a>
          <?php } ?>
        </div>
        <p class="blog__name">
          Последние записи
        </p>
        <div class="blog__last">
          <?php  $args=array(  
            'orderby'=>'date', 
            'orderby' => 'DESC',				  
            'showposts' => 3,  
            );  
            query_posts($args); 
            if (have_posts()) : while (have_posts()) : the_post();?>
                <a href="<?php the_permalink(); ?>" class="blog__last-item">
                  <p class="blog__last-name"><?php the_title(); ?></p>
                  <div class="blog__last-time">
                    <svg width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <g clip-path="url(#clip0_18_1685)">
                        <path d="M1.16379 14.8571H13.8366V5.71429H1.16379V14.8571ZM4.62001 4V1.42857C4.62001 1.34524 4.59301 1.27679 4.53901 1.22321C4.485 1.16964 4.416 1.14286 4.332 1.14286H3.75596C3.67195 1.14286 3.60295 1.16964 3.54895 1.22321C3.49494 1.27679 3.46794 1.34524 3.46794 1.42857V4C3.46794 4.08333 3.49494 4.15179 3.54895 4.20536C3.60295 4.25893 3.67195 4.28571 3.75596 4.28571H4.332C4.416 4.28571 4.485 4.25893 4.53901 4.20536C4.59301 4.15179 4.62001 4.08333 4.62001 4ZM11.5325 4V1.42857C11.5325 1.34524 11.5055 1.27679 11.4515 1.22321C11.3974 1.16964 11.3284 1.14286 11.2444 1.14286H10.6684C10.5844 1.14286 10.5154 1.16964 10.4614 1.22321C10.4074 1.27679 10.3804 1.34524 10.3804 1.42857V4C10.3804 4.08333 10.4074 4.15179 10.4614 4.20536C10.5154 4.25893 10.5844 4.28571 10.6684 4.28571H11.2444C11.3284 4.28571 11.3974 4.25893 11.4515 4.20536C11.5055 4.15179 11.5325 4.08333 11.5325 4ZM14.9887 3.42857V14.8571C14.9887 15.1667 14.8747 15.4345 14.6467 15.6607C14.4186 15.8869 14.1486 16 13.8366 16H1.16379C0.851772 16 0.581755 15.8869 0.353741 15.6607C0.125726 15.4345 0.0117188 15.1667 0.0117188 14.8571V3.42857C0.0117188 3.11905 0.125726 2.85119 0.353741 2.625C0.581755 2.39881 0.851772 2.28571 1.16379 2.28571H2.31587V1.42857C2.31587 1.03571 2.45688 0.699405 2.73889 0.419643C3.02091 0.139881 3.35993 0 3.75596 0H4.332C4.72802 0 5.06704 0.139881 5.34906 0.419643C5.63108 0.699405 5.77209 1.03571 5.77209 1.42857V2.28571H9.22831V1.42857C9.22831 1.03571 9.36932 0.699405 9.65134 0.419643C9.93335 0.139881 10.2724 0 10.6684 0H11.2444C11.6405 0 11.9795 0.139881 12.2615 0.419643C12.5435 0.699405 12.6845 1.03571 12.6845 1.42857V2.28571H13.8366C14.1486 2.28571 14.4186 2.39881 14.6467 2.625C14.8747 2.85119 14.9887 3.11905 14.9887 3.42857Z" fill="#AAAAAA" />
                      </g>
                      <defs>
                        <clipPath id="clip0_18_1685">
                          <rect width="15" height="16" fill="white" />
                        </clipPath>
                      </defs>
                    </svg>
                    <?php the_time('d.m.Y'); ?>
                  </div>
                  
                </a>
            <?php endwhile; else: ?>
            <?php endif; ?>
          <?php wp_reset_query();?>
        </div>
        <p class="blog__name">
          Теги
        </p>
        <div class="blog__tegs">
          <button class="blog__tag">Авиа Путешествия</button>
          <button class="blog__tag">Посадочный талон</button>
          <button class="blog__tag">Сроки</button>
          <button class="blog__tag">Возврат Авиабилетов</button>
          <button class="blog__tag">Справка о перелете</button>
          <button class="blog__tag">Маршрутная квитанция</button>
          <button class="blog__tag">Виды справок</button>
          <button class="blog__tag">Стоимость</button>    
        </div>
      </div>
      <div class="blog__content">
        <?php  
        $current_category = get_queried_object_id();
        $args=array(  
          'cat' => $current_category,  
          'orderby'=>'date', 
          'orderby' => 'DESC',				  
          'showposts' => -1,  
          );  
          query_posts($args); 
          if (have_posts()) : while (have_posts()) : the_post();?>
                  <a href="<?php the_permalink(); ?>" class="blog__item">
                    
                    <img loading="lazy" src="<?php the_post_thumbnail_url('medium'); ?>" class="image" width="445" height="360" alt="img">
                    
                    <div class="blog__inner">
                      <div class="blog__wrap">
                        <span class="blog__time">
                          <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_18_1619)">
                              <path d="M1.74192 14.8571H14.4147V5.71429H1.74192V14.8571ZM5.19814 4V1.42857C5.19814 1.34524 5.17114 1.27679 5.11713 1.22321C5.06313 1.16964 4.99413 1.14286 4.91012 1.14286H4.33408C4.25008 1.14286 4.18107 1.16964 4.12707 1.22321C4.07307 1.27679 4.04606 1.34524 4.04606 1.42857V4C4.04606 4.08333 4.07307 4.15179 4.12707 4.20536C4.18107 4.25893 4.25008 4.28571 4.33408 4.28571H4.91012C4.99413 4.28571 5.06313 4.25893 5.11713 4.20536C5.17114 4.15179 5.19814 4.08333 5.19814 4ZM12.1106 4V1.42857C12.1106 1.34524 12.0836 1.27679 12.0296 1.22321C11.9756 1.16964 11.9066 1.14286 11.8226 1.14286H11.2465C11.1625 1.14286 11.0935 1.16964 11.0395 1.22321C10.9855 1.27679 10.9585 1.34524 10.9585 1.42857V4C10.9585 4.08333 10.9855 4.15179 11.0395 4.20536C11.0935 4.25893 11.1625 4.28571 11.2465 4.28571H11.8226C11.9066 4.28571 11.9756 4.25893 12.0296 4.20536C12.0836 4.15179 12.1106 4.08333 12.1106 4ZM15.5668 3.42857V14.8571C15.5668 15.1667 15.4528 15.4345 15.2248 15.6607C14.9968 15.8869 14.7267 16 14.4147 16H1.74192C1.4299 16 1.15988 15.8869 0.931866 15.6607C0.703851 15.4345 0.589844 15.1667 0.589844 14.8571V3.42857C0.589844 3.11905 0.703851 2.85119 0.931866 2.625C1.15988 2.39881 1.4299 2.28571 1.74192 2.28571H2.89399V1.42857C2.89399 1.03571 3.035 0.699405 3.31702 0.419643C3.59904 0.139881 3.93806 0 4.33408 0H4.91012C5.30615 0 5.64517 0.139881 5.92719 0.419643C6.2092 0.699405 6.35021 1.03571 6.35021 1.42857V2.28571H9.80643V1.42857C9.80643 1.03571 9.94744 0.699405 10.2295 0.419643C10.5115 0.139881 10.8505 0 11.2465 0H11.8226C12.2186 0 12.5576 0.139881 12.8396 0.419643C13.1216 0.699405 13.2627 1.03571 13.2627 1.42857V2.28571H14.4147C14.7267 2.28571 14.9968 2.39881 15.2248 2.625C15.4528 2.85119 15.5668 3.11905 15.5668 3.42857Z" fill="#565353" />
                            </g>
                            <defs>
                              <clipPath id="clip0_18_1619">
                                <rect width="15" height="16" fill="white" transform="translate(0.578125)" />
                              </clipPath>
                            </defs>
                          </svg>
                          <?php the_time('d.m.Y'); ?>
                        </span>

                        <span class="blog__com">
                          <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_18_1623)">
                              <path d="M14.5977 5.5C14.5977 6.40625 14.2852 7.24349 13.6602 8.01172C13.0352 8.77995 12.1862 9.38672 11.1133 9.83203C10.0404 10.2773 8.86849 10.5 7.59766 10.5C7.23307 10.5 6.85547 10.4792 6.46484 10.4375C5.43359 11.349 4.23568 11.9792 2.87109 12.3281C2.61589 12.401 2.31901 12.4583 1.98047 12.5C1.89193 12.5104 1.8125 12.487 1.74219 12.4297C1.67188 12.3724 1.6263 12.2969 1.60547 12.2031V12.1953C1.58984 12.1745 1.58854 12.1432 1.60156 12.1016C1.61458 12.0599 1.61979 12.0339 1.61719 12.0234C1.61458 12.013 1.6263 11.9883 1.65234 11.9492L1.69922 11.8789L1.75391 11.8125L1.81641 11.7422C1.85286 11.7005 1.93359 11.6107 2.05859 11.4727C2.18359 11.3346 2.27344 11.2357 2.32812 11.1758C2.38281 11.1159 2.46354 11.013 2.57031 10.8672C2.67708 10.7214 2.76172 10.5885 2.82422 10.4688C2.88672 10.349 2.95703 10.1953 3.03516 10.0078C3.11328 9.82031 3.18099 9.6224 3.23828 9.41406C2.42057 8.95052 1.77604 8.3776 1.30469 7.69531C0.833333 7.01302 0.597656 6.28125 0.597656 5.5C0.597656 4.82292 0.782552 4.17578 1.15234 3.55859C1.52214 2.94141 2.01953 2.40885 2.64453 1.96094C3.26953 1.51302 4.01432 1.15755 4.87891 0.894531C5.74349 0.63151 6.64974 0.5 7.59766 0.5C8.86849 0.5 10.0404 0.722656 11.1133 1.16797C12.1862 1.61328 13.0352 2.22005 13.6602 2.98828C14.2852 3.75651 14.5977 4.59375 14.5977 5.5Z" fill="#565353" />
                            </g>
                            <defs>
                              <clipPath id="clip0_18_1623">
                                <rect width="14.04" height="12" fill="white" transform="translate(0.578125 0.5)" />
                              </clipPath>
                            </defs>
                          </svg>
                          <?php
                            $comment_count = get_comments_number();
                            echo $comment_count . ' ';
                            echo _n('комментарий', 'комментария', $comment_count, 'your-text-domain');
                            ?>
                        </span>
                      </div>
                      <p class="blog__subtitle">
                        <?php the_title(); ?>
                      </p>
                      <div class="blog__text">
                        <?php 
                          $content = get_the_content();
                          if (preg_match('/<p>(.*?)<\/p>/s', $content, $match)) {
                              echo $match[0];  // Выводим первый найденный <p>...</p>
                          }
                          ?>
                      </div>
                      
                    </div>
                   </a>
              <?php endwhile; else: ?>
              <?php endif; ?>
        <?php wp_reset_query();?>
      </div>
      </div>
      
    </div>
  </section>

 </main> 


<?php get_footer(); ?>